amadeann.jack-language-syntax-highlighting
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
esbenp.prettier-vscode
gruntfuggly.todo-tree
humao.rest-client
mechatroner.rainbow-csv
mikestead.dotenv
orta.vscode-twoslash-queries
pkief.material-icon-theme
pomdtr.excalidraw-editor
redhat.vscode-yaml
ritwickdey.liveserver
roblourens.vscode-nand2tetris-hdl
svelte.svelte-vscode
tomoki1207.pdf
vunguyentuan.vscode-css-variables
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
