amadeann.jack-language-syntax-highlighting
bradlc.vscode-tailwindcss
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
esbenp.prettier-vscode
foxundermoon.shell-format
gruntfuggly.todo-tree
haskell.haskell
justusadam.language-haskell
mechatroner.rainbow-csv
mikestead.dotenv
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
orta.vscode-twoslash-queries
pkief.material-icon-theme
pomdtr.excalidraw-editor
redhat.vscode-yaml
ritwickdey.liveserver
roblourens.vscode-nand2tetris-hdl
svelte.svelte-vscode
tomoki1207.pdf
twxs.cmake
vunguyentuan.vscode-css-variables
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
