tap "homebrew/bundle"
brew "fish"
brew "fnm"
brew "git"
brew "pnpm"
brew "starship"
cask "firefox@developer-edition"
cask "font-fira-code-nerd-font"
cask "git-credential-manager"
cask "iterm2"
cask "rectangle"
cask "responsively"
cask "spotify"
cask "temurin"
cask "visual-studio-code"
vscode "amadeann.jack-language-syntax-highlighting"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "orta.vscode-twoslash-queries"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "ritwickdey.liveserver"
vscode "roblourens.vscode-nand2tetris-hdl"
vscode "svelte.svelte-vscode"
vscode "tomoki1207.pdf"
vscode "vunguyentuan.vscode-css-variables"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
