tap "homebrew/bundle"
brew "bash"
brew "bat"
brew "deno"
brew "fish"
brew "fnm"
brew "git"
brew "git-delta"
brew "pnpm"
brew "starship"
brew "uthash"
cask "discord"
cask "docker"
cask "firefox@developer-edition"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "git-credential-manager"
cask "google-chrome"
cask "rectangle"
cask "responsively"
cask "spotify"
cask "temurin"
cask "visual-studio-code"
cask "zed"
vscode "amadeann.jack-language-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "orta.vscode-twoslash-queries"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "roblourens.vscode-nand2tetris-hdl"
vscode "svelte.svelte-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vunguyentuan.vscode-css-variables"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
